cask_args appdir: '/Applications'

tap 'caskroom/versions'
tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'gcc'
brew 'git'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'node'
brew 'openssl'
brew 'rbenv'
brew 'roundup'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'