cask_args appdir: '/Applications'

tap 'caskroom/versions'
tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'flac'
brew 'gcc'
brew 'git'
brew 'graphicsmagick'
brew 'grc'
brew 'jq'
brew 'lame'
brew 'libogg'
brew 'memcached'
brew 'mongodb'
brew 'mysql'
brew 'node'
brew 'openssl'
brew 'postgres'
brew 'redis'
brew 'shellcheck'
brew 'sox', args: ['with-lame', 'with-flac', 'with-libvorbis']
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
