cask_args appdir: '/Applications'

tap 'caskroom/versions'
tap 'homebrew/bundle'

# required for compilage
brew 'gcc'

# codecs
brew 'flac'
brew 'lame'
brew 'libogg'

# utils
brew 'ack'
brew 'coreutils'
brew 'jq'
brew 'openssl'
brew 'sox', args: ['with-lame', 'with-flac', 'with-libvorbis']
brew 'unrar'
brew 'wget'
cask 'copyq'

# scc
brew 'git'
brew 'git-lfs'

# js / react  dev
brew 'watchman'

# tooling
cask 'fastlane'
brew 'shellcheck'

# containers
brew 'docker'
brew 'docker-compose'
brew 'kubernetes-cli'
cask 'minikube'

# editors
cask 'atom'
# cask 'sublime-text'
cask 'visual-studio-code'

# terminal
brew 'zsh'
brew 'zsh-completions'
cask 'iterm2'

# browsers

# quicklook providers (mac)
cask 'provisionql'

# password managers
# cask '1password'

# misc
brew 'transmission'
cask 'alfred'
cask 'plex-media-server'
cask 'station'
cask 'notion'
