cask_args appdir: '/Applications'

tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'koekeishiya/formulae'

# languages & package managers
brew 'esy'
brew 'mas'
brew 'python'
brew 'python3'
brew 'pipenv'
brew 'yarn'

# shell
brew 'zsh'
brew 'zsh-completions'

# source code control
brew 'git'
brew 'git-lfs'

# codecs
brew 'flac'
brew 'lame'
brew 'libogg'

# utils
brew 'ack'
brew 'bcal'
brew 'gcc'
brew 'hub'
brew 'jq'
brew 'sox', args: ['with-lame', 'with-flac', 'with-libvorbis']
brew 'unrar'

# desktop environment
brew 'chunkwm'
cask 'alfred'

# core software
cask 'alacritty'
brew 'aria2'
brew 'feh'
brew 'fzf'
cask 'insync'
cask 'kitty'
# brew 'maim' - mac equivelant?
brew 'mpd'
brew 'mpv'
brew 'ncmpcpp'
brew 'neofetch'
brew 'nnn'
brew 'ripgrep'
brew 'srccpy'
brew 'task'
brew 'tmux'
brew 'w3m'

# fonts
cask "font-fantasque-sans-mono"
cask "font-fira-code"

# docker
brew 'docker'
brew 'docker-compose'

# kubernetes
brew 'kubernetes-cli'
cask 'minikube'

# editors
# brew 'emacs'
brew 'neovim'
# cask 'oni'
# cask 'sublime-text'
cask 'veonim'
# cask 'visual-studio-code-insiders'

# dev
brew 'watchman'
# brew 'shellcheck'
cask 'google-cloud-sdk'
cask 'fastlane'

# browsers
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
# cask 'vivaldi'
cask 'vivaldi-snapshot'

# quicklook providers
# cask 'provisionql'

# password managers
cask '1password'

# misc
cask 'krita'
# brew 'transmission'
# cask 'plex-media-server'
# cask 'station'
# cask 'notion'
